src/cf/InformationRegisters/СведенияОГолосовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СведенияОГолосовании</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВариантОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СведенияОГолосовании/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Устанавливает результат голосования для пользователя по предмету.
Процедура УстановитьВариантОтветаПользователя(Сообщение, ВариантОтвета, Знач Пользователь = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = СотрудникиВызовСервера.ОсновнойСотрудникПользователя(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	Запись = РегистрыСведений.СведенияОГолосовании.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	
	Запись.Пользователь = Пользователь;
	Запись.Сообщение = Сообщение;
	Запись.ВариантОтвета = ВариантОтвета;
	Запись.Записать(Истина);
	
КонецПроцедуры

// Очищает результаты голосования по предмету у всех пользователей.
Процедура УбратьСведенияОГолосовании(Сообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.СведенияОГолосовании.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Процедура очищает результата голосования по предмету у пользователя.
Процедура ОтменитьГолосПользователя(Сообщение, Знач Пользователь = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = СотрудникиВызовСервера.ОсновнойСотрудникПользователя(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.СведенияОГолосовании.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сообщение.Установить(Сообщение);
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Возвращает признак Прочтен для объекта у Пользователя (ТекущегоПользователя).
Функция ПолучитьВариантОтветаПользователя(Сообщение, Знач Пользователь = Неопределено) Экспорт 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Пользователь = Неопределено Тогда
		Пользователь = СотрудникиВызовСервера.ОсновнойСотрудникПользователя(ПользователиКлиентСервер.ТекущийПользователь());
	КонецЕсли;
	
	Запись = РегистрыСведений.СведенияОГолосовании.СоздатьМенеджерЗаписи();
	Запись.Пользователь = Пользователь;
	Запись.Сообщение = Сообщение;
	Запись.Прочитать();
	
	Если Не Запись.Выбран() Тогда
		Возврат 0;
	КонецЕсли;
	
	Возврат Запись.ВариантОтвета;
	
КонецФункции

#КонецОбласти

#КонецЕсли
